/*
2019年10月06日20:26:19 想不出D题自闭了好久,然后来看E题,其实没有必要自闭,毕竟很多思路都很精妙,一时想不出来也没有关系,多多训练,多积累精妙的思路,形成题感,然后冲一把金牌,加油

2019年10月06日20:33:23 靠,感觉C,D1,D2,E都不会...菜鸡我只能做出A,B题...尴尬
没事,1小时20mins结束了VP,然后开始补题算了,好像没法终止比赛,那就补其他场次的题目吧

2019年10月10日22:18:25 继续挣扎一会儿明安图-卡特兰数

 the number of arrays consisting of x ones and y minus ones such that their maximal prefix sum is equal to 0
 由x和y减数组成的数组的数量，以使它们的最大前缀和等于0

 这里是数组的数目,也就是说一种排列形成的最大前缀和---> 一开始自己没有结合题意...  --- 所以白卡了半天...下次要注意结合


 真的感觉到自己的理解能力慢慢有所长进了,之前一窍不通,到现在还能理解一点点,继续练习,
 ACM一定可以锻炼自己的算法能力,coding能力,English阅读能力,理解能力,数学建模能力的,加油,这些练好了,以后学其他东西会很快,并且能做得好,所以享受学算法的日子


 2019年10月10日22:49:57明天再来吧
*/